---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralI.GetFlangeThicknessInFlangeCenter
source: html/46f6b1ef-44f4-d429-fd63-b5a98db15f2f.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralI.GetFlangeThicknessInFlangeCenter Method

Returns thickness of flange measured in the 0.25 * (width - webThickess),
 sometimes used for sections with width > 300 mm.

## Syntax (C#)
```csharp
public double GetFlangeThicknessInFlangeCenter()
```